app/controllers/activities_controller.rb

INSERT INTO "activities" ("customer_id", "subject", "activity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save

DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 2]]
---
  def destroy
    @activity.destroy

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_activity
      @activity = Activity.find(params[:id])