app/controllers/customers_controller.rb

INSERT INTO "customers" ("reason", "cnpj", "phone", "mayor", "cpf_mayor", "city_hall", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save