app/views/activities/_form.html.erb

      <div class="col-sm-10">
        <%= form.select :customer_id, options_for_select(Customer.all.map{|s|[s.reason, s.id]}), include_blank: "Selecione" %>
---
SELECT "customers".* FROM "customers"